experiments/05_heartbeat_elastic_vessel/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Experiment 05 — Elastic vessel wall: point displacement boundary conditions.
//
// ── Structural model ──────────────────────────────────────────────────────────
// Thin-shell (Lamé) radial displacement:
//
//   δR(t) = Δp(t) · R² / (E · h)
//
// where:
//   Δp(t) = p(t) − p_ref     transmural pressure change from diastolic reference
//   p_ref  = 80 mmHg          initial (diastolic) reference pressure
//   R      = 0.005 m          vessel radius
//   E      = 0.5 MPa          Young's modulus (human artery, see reference below)
//   h      = 0.001 m          wall thickness (h/R = 0.2)
//
// Maximum radial displacement (at systolic peak, Δp = 40 mmHg ≈ 5333 Pa):
//   δR_max = 5333 × (0.005)² / (0.5×10⁶ × 0.001) = 0.267 mm  (≈ 5.3 % of R)
//
// This is within the physiologically observed 5–10 % diameter variation in vivo.
//
// Reference for wall material properties:
//   Holzapfel GA, Ogden RW.
//   "Constitutive modelling of arteries."
//   Proc. Royal Society A. 2010;466:1551–1597. doi:10.1098/rspa.2009.0357
//   (open access — typical arterial Young's modulus E = 0.1–3 MPa)
//
// ── Displacement direction ────────────────────────────────────────────────────
// Each wall point at (0, y, z) moves purely radially:
//   d(t) = δR(t) · (0, y/r, z/r)   where r = √(y²+z²) = R
//
// Inlet and outlet planes are held fixed (no axial stretch modelled).

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);    // reference state = diastolic (80 mmHg)

boundaryField
{
    inlet
    {
        // Inlet plane is clamped — no axial or radial displacement.
        type            fixedValue;
        value           uniform (0 0 0);
    }

    outlet
    {
        // Outlet plane is clamped — no axial or radial displacement.
        type            fixedValue;
        value           uniform (0 0 0);
    }

    wall
    {
        // Thin-shell compliance: radial displacement driven by Murgo waveform.
        // Displacement is measured from the diastolic reference state (80 mmHg).
        type            codedFixedValue;
        value           uniform (0 0 0);
        name            elasticVesselWall;

        code
        #{
            // ── Structural parameters ─────────────────────────────────────
            const scalar T   = 0.857;      // cardiac period [s]
            const scalar E_w = 0.5e6;      // Young's modulus [Pa]
            const scalar h_w = 1.0e-3;     // wall thickness [m]
            const scalar R   = 5.0e-3;     // vessel radius [m]

            // Reference (diastolic) kinematic pressure → physical Pa
            const scalar p_ref = 80.0 * 133.322;   // 80 mmHg in Pa

            // ── Murgo (1980) pressure table ───────────────────────────────
            // 21 control points at equal Δt ≈ 0.04285 s over one cycle.
            const scalar tbl_t[21] =
            {
                0.00000, 0.04285, 0.08570, 0.12855, 0.17140, 0.21425, 0.25710,
                0.29995, 0.34280, 0.38565, 0.42850, 0.47135, 0.51420, 0.55705,
                0.59990, 0.64275, 0.68560, 0.72845, 0.77130, 0.81415, 0.85700
            };
            const scalar tbl_p[21] =   // [Pa] — physical pressure
            {
                 80*133.322,  81*133.322,  92*133.322, 110*133.322, 120*133.322,
                118*133.322, 113*133.322, 107*133.322, 102*133.322,  97*133.322,
                 93*133.322,  96*133.322,  92*133.322,  89*133.322,  87*133.322,
                 85*133.322,  83*133.322,  82*133.322,  81*133.322,  80*133.322,
                 80*133.322
            };

            // ── Phase within cardiac cycle ────────────────────────────────
            const scalar t    = this->db().time().value();
            const scalar tmod = t - std::floor(t / T) * T;

            // ── Linear interpolation ──────────────────────────────────────
            scalar p_now = tbl_p[20];
            for (label i = 0; i < 20; i++)
            {
                if (tmod >= tbl_t[i] && tmod < tbl_t[i + 1])
                {
                    const scalar alpha =
                        (tmod - tbl_t[i]) / (tbl_t[i + 1] - tbl_t[i]);
                    p_now = tbl_p[i] + alpha * (tbl_p[i + 1] - tbl_p[i]);
                    break;
                }
            }

            // ── Thin-shell radial displacement ────────────────────────────
            // δR = Δp · R² / (E · h)   (Δp measured from diastolic reference)
            const scalar deltaR =
                (p_now - p_ref) * R * R / (E_w * h_w);

            // ── Apply radial displacement at each wall point ──────────────
            const pointField& pts = this->patch().localPoints();
            Field<vector> disp(pts.size(), vector::zero);
            forAll(pts, i)
            {
                const scalar y = pts[i].y();
                const scalar z = pts[i].z();
                const scalar r = std::sqrt(y*y + z*z);
                if (r > SMALL)
                {
                    disp[i] = vector(0.0, deltaR * y / r, deltaR * z / r);
                }
            }
            operator==(disp);
        #};
    }
}

// ************************************************************************* //
